app/views/hmds/edit.html.haml

          = form_for hmd do |f|
            = f.select :state, [["Announced", "announced"], ["DevKit", "devkit"], ["Released", "released"]]
---
SELECT  "hmd_states".* FROM "hmd_states" WHERE "hmd_states"."hmd_id" = $1  ORDER BY created_at DESC LIMIT 1  [["hmd_id", 3]]