app/controllers/hmds_controller.rb

  def index
    @hmds = Hmd.all.order("announced_at desc, name desc")
---
SELECT "hmds".* FROM "hmds"  ORDER BY announced_at desc, name desc

  def edit
    @hmds = Hmd.all.order("announced_at desc, name desc")
---
SELECT "hmds".* FROM "hmds"  ORDER BY announced_at desc, name desc

  def update
    @hmd = Hmd.find(params[:id])
    @hmd.state = params[:hmd][:state]
    @hmd.save!
---
SELECT  "hmds".* FROM "hmds" WHERE "hmds"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "hmds" SET "state" = $1, "updated_at" = $2 WHERE "hmds"."id" = $3  [["state", "devkit"], ["updated_at", "2015-05-29 01:08:31.331935"], ["id", 2]]